<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');
//公共方法
/**
 * 检测用户是否登录
 * @return integer 0-未登录，大于0-当前登录用户ID
 */
function is_login(){
	$SC =& get_instance();
	$SC->load->library('session');
    $uid = $SC->session->userdata('uid');
    if (empty($uid)) {
        return 0;
    } else {
        return $uid ? $uid : 0;
    }
}
/**
 * 检测当前用户是否为管理员
 * @return boolean true-管理员，false-非管理员
 */
function is_administrator($uid = null){
    $uid = is_null($uid) ? is_login() : $uid;
    return $uid && (intval($uid) === 1);
}
/**
 * 数据签名认证
 * @param  array  $data 被认证的数据
 * @return string       签名
 */
function data_auth_sign($data) {
    //数据类型检测
    if(!is_array($data)){
        $data = (array)$data;
    }
    ksort($data); //排序
    $code = http_build_query($data); //url编码并生成query字符串
    $sign = sha1($code); //生成签名
    return $sign;
}
/**
 * 字符串截取，支持中文和其他编码
 * @static
 * @access public
 * @param string $str 需要转换的字符串
 * @param string $start 开始位置
 * @param string $length 截取长度
 * @param string $charset 编码格式
 * @param string $suffix 截断显示字符
 * @return string
 */
function msubstr($str, $start=0, $length, $charset="utf-8", $suffix=true) {
    if(function_exists("mb_substr"))
        $slice = mb_substr($str, $start, $length, $charset);
    elseif(function_exists('iconv_substr')) {
        $slice = iconv_substr($str,$start,$length,$charset);
        if(false === $slice) {
            $slice = '';
        }
    }else{
        $re['utf-8']   = "/[\x01-\x7f]|[\xc2-\xdf][\x80-\xbf]|[\xe0-\xef][\x80-\xbf]{2}|[\xf0-\xff][\x80-\xbf]{3}/";
        $re['gb2312'] = "/[\x01-\x7f]|[\xb0-\xf7][\xa0-\xfe]/";
        $re['gbk']    = "/[\x01-\x7f]|[\x81-\xfe][\x40-\xfe]/";
        $re['big5']   = "/[\x01-\x7f]|[\x81-\xfe]([\x40-\x7e]|\xa1-\xfe])/";
        preg_match_all($re[$charset], $str, $match);
        $slice = join("",array_slice($match[0], $start, $length));
    }
    return $suffix ? $slice.'...' : $slice;
}
/**
 * 系统加密方法
 * @param string $data 要加密的字符串
 * @param string $key  加密密钥
 * @param int $expire  过期时间 单位 秒
 * @return string
 */
function suny_encrypt($data, $key = '', $expire = 0) {
    $key  = md5(empty($key) ? 'Suny' : $key);
    $data = base64_encode($data);
    $x    = 0;
    $len  = strlen($data);
    $l    = strlen($key);
    $char = '';

    for ($i = 0; $i < $len; $i++) {
        if ($x == $l) $x = 0;
        $char .= substr($key, $x, 1);
        $x++;
    }

    $str = sprintf('%010d', $expire ? $expire + time():0);

    for ($i = 0; $i < $len; $i++) {
        $str .= chr(ord(substr($data, $i, 1)) + (ord(substr($char, $i, 1)))%256);
    }
    return str_replace(array('+','/','='),array('-','_',''),base64_encode($str));
}

/**
 * 系统解密方法
 * @param  string $data 要解密的字符串 （必须是suny_encrypt方法加密的字符串）
 * @param  string $key  加密密钥
 * @return string
 */
function suny_decrypt($data, $key = ''){
    $key    = md5(empty($key) ? 'Suny' : $key);
    $data   = str_replace(array('-','_'),array('+','/'),$data);
    $mod4   = strlen($data) % 4;
    if ($mod4) {
       $data .= substr('====', $mod4);
    }
    $data   = base64_decode($data);
    $expire = substr($data,0,10);
    $data   = substr($data,10);
    if($expire > 0 && $expire < time()) {
        return '';
    }
    $x      = 0;
    $len    = strlen($data);
    $l      = strlen($key);
    $char   = $str = '';
    for ($i = 0; $i < $len; $i++) {
        if ($x == $l) $x = 0;
        $char .= substr($key, $x, 1);
        $x++;
    }

    for ($i = 0; $i < $len; $i++) {
        if (ord(substr($data, $i, 1))<ord(substr($char, $i, 1))) {
            $str .= chr((ord(substr($data, $i, 1)) + 256) - ord(substr($char, $i, 1)));
        }else{
            $str .= chr(ord(substr($data, $i, 1)) - ord(substr($char, $i, 1)));
        }
    }
    return base64_decode($str);
}
//验证手机
function is_phone($phone){
    if(! preg_match("/^1[34578]{1}[0-9]{9}$/", trim($phone))){
        return FALSE;
    }else{
        return TRUE;
    }
}
//验证密码 type1 字母加数字  2 字母
function is_password($pwd, $type = 1){
    if($type == 1){
        if(! preg_match("/^(?=.*?[a-zA-Z])(?=.*?[0-9])[a-zA-Z0-9]{6,20}$/", trim($pwd))){
            return FALSE;
        }else{
            return TRUE;
        }
    }else{
        if(! preg_match('/^[a-zA-Z]{3,20}$/', trim($pwd))){
            return FALSE;
        }else{
            return TRUE;
        }
    }
}
/* 无限极分类获得一维数组 */
function get_son_arr($arr, $pname = '', $pid = 0, $level = '　├ ') {
    $tree = array();
    if(! is_array($arr)){
        return false;
    }
    if(! is_string($pname)){
        return false;
    }
    foreach($arr as $v){
        $pnames = empty($pname) ? 'pid' : $pname;
        if($v[$pnames] == $pid){
            $v['level'] = $level;
            $tree[] = $v;
            $tree = array_merge($tree,get_son_arr($arr, $pnames, $v['id'], '　' . $level));
        }
    }
    return $tree;
}
/* 无限极分类获得多维数组 */
function get_sons_arr($arr, $pname = '', $pid = 0, $level = '　 ') {
    $tree = array();
    if(! is_array($arr)){
        return false;
    }
    if(! is_string($pname)){
        return false;
    }
    foreach($arr as $k => $v){
        $pnames = empty($pname) ? 'pid' : $pname;
        if($v[$pnames] == $pid){
            $v['level'] = $level;
            $v['child'] = get_sons_arr($arr, $pname, $v['id'], '　' . $level);
            $tree[] = $v;
        }
    }
    return $tree;
}
//通过PID获取所有父级id
function get_parents_byid ($cate, $pid) {
    $arr = array();
    if(! is_array($arr)){
        return false;
    }
    foreach ($cate as $v) {
        if ($v['id'] == $pid) {
            $arr[] = $v;
            $arr = array_merge(get_childs_byid($cate, $v['pid']), $arr);
        }
    }
    return $arr;
}
//php数组格式化
function p($arr){
    return '<pre>' . print_r($arr) . '<pre>';
}
function get_user($id){
    $CI =& get_instance();
    $CI->load->model('user/ausers_model');
    return $CI->ausers_model->get_ausers_byuid($id);
}
//配置物资类别
function get_wzlb() {
	return array(
		'1' => '疫苗类',
		'2' => '诊断试剂',
		'3' => '消毒剂类',
		'4' => '防护用品类',
		'5' => '器械类',
		'6' => '封锁设施类',
		'7' => '畜禽标识类',
		'8' => '其他',
		'9' => '扑杀用品'
	);
}
//配置物资名称
function get_wzmc() {
	return array(
		'1' => array(
			'1' => '新城疫L系',
			'2' => '高致病性猪蓝耳病弱毒苗',
			'3' => '高致病性猪蓝耳病灭活苗',
			'4' => '猪瘟',
			'5' => 'O型口蹄疫',
			'6' => 'O型-亚洲1型口蹄疫',
			'7' => 'A型口蹄疫',
			'8' => '高致病性禽流感(双价苗)',
			'9' => '高致病性禽流感(单价苗)',
			'10' => '高致病性禽流感（Re-6Re-8',
			'11' => '高致病性禽流感（Re-6Re-7Re-8'
		),
		'2' => array(
			'12' => '牛羊口蹄疫非结构蛋白ELISA',
			'13' => '猪口蹄疫非结构蛋白ELISA',
			'14' => '口蹄疫荧光RT-PCR',
			'15' => 'O型液相阻断ELISA',
			'16' => '亚洲I型液相阻断ELISA',
			'17' => 'A型液相阻断ELISA',
			'18' => '猪瘟荧光RT-PCR',
			'19' => '猪瘟抗体ELISA',
			'20' => '禽流感通用荧光RT-PCR',
			'21' => 'H5亚型禽流感荧光RT-PCR',
			'22' => 'H7亚型禽流感荧光RT-PCR',
			'23' => 'H9亚型禽流感荧光RT-PCR',
			'24' => '禽流感血凝抗原（RE-6)',
			'25' => '禽流感阳性血清（RE-6)',
			'26' => '禽流感血凝抗原（RE-7)',
			'27' => '禽流感阳性血清（RE-7)',
			'28' => '禽流感血凝抗原（H7)',
			'29' => '禽流感阳性血清（H7)',
			'30' => '新城疫抗体',
			'31' => '新城疫阳性血清',
			'32' => '新城疫阳性血清',
			'33' => '布病ELISA',
			'34' => '结核ELISA',
			'35' => '蓝耳病荧光RT-PCR',
			'36' => '蓝耳病抗体ELISA',
			'37' => '猪伪狂犬基因缺失ELISA',
			'38' => '新城疫中强毒荧光RT-PCR',
			'39' => '狂犬病荧光RT-PCR',
			'40' => '狂犬病抗体ELISA（定量）',
			'41' => '兔瘟抗体ELISA',
			'42' => '禽白血病抗原ELISA',
			'43' => '猪细小病毒荧光PCR',
			'44' => '猪圆环病毒荧光PCR',
			'45' => '传染性法氏囊荧光RT-PCR试剂盒',
			'46' => '产蛋下降综合征荧光RT-PCR',
			'47' => '鸡传染性喉气管炎荧光RT-PCR',
			'48' => '鸡败血支原体荧光RT-CPR',
			'49' => '鸡马立克氏病荧光RT-PCR',
			'50' => '鸡白痢平板凝集试剂',
			'51' => '羊小反刍兽疫荧光RT-PCR',
			'52' => '禽肠炎沙门氏菌ELISA试剂盒',
			'53' => '猪流行性腹泻(PED)荧光RT-PCR',
			'54' => '猪传染性胃肠炎（TGE)荧光RT-PCR',
			'55' => '猪轮状病毒病(PRV-A)荧光RT-PCR',
			'56' => '核酸提取试剂盒（磁珠法）',
			'57' => '禽流感血凝抗原（RE-8）',
		),
		'3' => array(
			'58' => '复方戊二醛',
			'59' => '月苄三甲氯铵溶液',
			'60' => '复合亚氯酸钠',
			'61' => '20%高效二氯异氰脲酸钠散',
			'62' => '戊二醛葵甲溴铵溶液',
			'63' => '火碱'

		),
		'4' => array(
			'64' => '连体防护服',
			'65' => '防寒服',
			'66' => '胶靴',
			'67' => '线手套',
			'68' => '医用口罩',
			'69' => '防护服',
			'70' => '防毒口罩',
			'71' => '护目镜',
			'72' => '乳胶手套',
			'73' => '专业防护口罩',
			'74' => '分体防护服',
			'75' => '鞋套',
			'76' => '头套'
		),
		'5' => array(
			'77' => '机动喷雾器',
			'78' => '喷烟火雾器',
			'79' => '储压喷雾器',
			'80' => '塑料桶',
			'81' => '防水薄膜',
			'82' => '动物尸体袋',
			'83' => '连续注射器',
			'84' => '针头',
			'85' => '剪子',
			'86' => '一次性注射器',
			'87' => '扑杀器',
			'88' => '手电筒',
			'89' => '脚套',
			'90' => '应急灯',
			'91' => '药棉',
			'92' => '冷藏箱',
			'93' => '金属针管'

		),
		'6' => array(
			'94' => '警示线',
			'95' => '警示牌'
		),
		'7' => array(
			'96' => '猪耳标',
			'97' => '牛耳标',
			'98' => '羊耳标',
			'99' => '奶牛耳标'
		),
		'8' => array(
			'100' => '电缆线',
			'101' => '冷藏箱',
			'102' => '电冰箱',
		), 
	);
}
//配置单位
function get_dig() {
	return array(
		'1' => '万毫升(万头份)',
		'2' => '万毫升(万头份)',
		'3' => '万毫升(万头份)',
		'4' => '万毫升(万头份)',
		'5' => '万毫升(万头份)',
		'6' => '万毫升(万头份)',
		'7' => '万毫升(万头份)',
		'8' => '万毫升(万头份)',
		'9' => '万毫升(万头份)',
		'10' => '万毫升(万头份)',
		'11' => '万毫升(万头份)',
		'12' => '盒',
		'13' => '盒',
		'14' => '盒',
		'15' => '盒',
		'16' => '盒',
		'17' => '盒',
		'18' => '盒',
		'19' => '盒',
		'20' => '盒',
		'21' => '盒',
		'22' => '盒',
		'23' => '盒',
		'24' => '瓶',
		'25' => '瓶',
		'26' => '瓶',
		'27' => '瓶',
		'28' => '瓶',
		'29' => '瓶',
		'30' => '瓶',
		'31' => '瓶',
		'32' => '瓶',
		'33' => '盒',
		'34' => '盒',
		'35' => '盒',
		'36' => '盒',
		'37' => '盒',
		'38' => '盒',
		'39' => '盒',
		'40' => '盒',
		'41' => '盒',
		'42' => '盒',
		'43' => '盒',
		'44' => '盒',
		'45' => '盒',
		'46' => '盒',
		'47' => '盒',
		'48' => '盒-CPR',
		'49' => '盒',
		'50' => '盒',
		'51' => '盒',
		'52' => '盒',
		'53' => '盒',
		'54' => '盒',
		'55' => '盒',
		'56' => '盒',
		'57' => '盒',
		'58' => '吨',
		'59' => '吨',
		'60' => '吨',
		'61' => '吨',
		'62' => '吨',
		'63' => '吨',
		'64' => '套',
		'65' => '套',
		'66' => '双',
		'67' => '副',
		'68' => '个',
		'69' => '套',
		'70' => '个',
		'71' => '副',
		'72' => '副',
		'73' => '个',
		'74' => '套',
		'75' => '套',
		'76' => '个',
		'77' => '台',
		'78' => '台',
		'79' => '台',
		'80' => '个',
		'81' => '吨',
		'82' => '个',
		'83' => '套',
		'84' => '个',
		'85' => '个',
		'86' => '个',
		'87' => '台',
		'88' => '个',
		'89' => '副',
		'90' => '个',
		'91' => '个',
		'92' => '个',
		'93' => '个',
		'94' => '个',
		'95' => '个',
		'96' => '万套',
		'97' => '万套',
		'98' => '万套',
		'99' => '万套',
		'100' => '个',
		'101' => '个',
		'102' => '台'
	);
}
//配置单位
function get_company() {
	return array(
		'1' => array(
				'1' => '广西丽原生物股份有限公司',
			),
		'2' =>  array(
				'1' => '齐鲁动物保健品有限公司',
				'2' => '武汉中博生物股份有限公司',
			),
		'3' => array(
				'1' => '齐鲁动物保健品有限公司',
				'2' => '武汉中博生物股份有限公司',
			),
		'4' => array(
				'1' => '齐鲁动物保健品有限公司',
				'2' => '哈尔滨元亨生物药业有限公司',
			),
		'5' => array(
				'1' => '中牧实业股份有限公司',
				'2' => '中农威特生物科技股份有限公司',
			),
		'6' => array(
				'1' => '中牧实业股份有限公司',
				'2' => '中农威特生物科技股份有限公司',
				'3' => '天康生物股份有限公司',
			),
		'7' => array(
				'1' => '中农威特生物科技股份有限公司',
			),
		'8' => array(
				'1' => '乾元浩生物股份有限公司',
				'2' => '青岛易邦生物工程有限公司',
			),
		'9' => array(
				'1' => '乾元浩生物股份有限公司',
			),
		'10' => array(
				'1' => '青岛易邦生物工程有限公司',
				'2' => '郑州乾元浩',
			),
		'11' => array(
				'1' => '青岛易邦生物工程有限公司',
				'2' => '乾元浩生物股份有限公司',
				'3' => '肇庆大华农生物药品有限公司',
			),
		'12' => array(
				'1' => '北京世纪元亨',
			),
		'13' => array(
				'1' => '北京世纪元亨',
			),
		'14' => array(
				'1' => '凯杰生物',
			),
		'15' => array(
				'1' => '兰州兽医研究所',
			),
		'16' => array(
				'1' => '兰州兽医研究所',
			),
		'17' => array(
				'1' => '兰州兽医研究所',
			),
		'18' => array(
				'1' => '凯杰生物',
			),
		'19' => array(
				'1' => 'IDEXX',
				'2' => '武汉科前',
			),
		'20' => array(
				'1' => '凯杰生物',
			),
		'21' => array(
				'1' => '凯杰生物',
			),
		'22' => array(
				'1' => '凯杰生物',
			),
		'23' => array(
				'1' => '哈尔滨兽医研究所',
			),
		'24' => array(
				'1' => '哈尔滨兽医研究所',
				'2' => '青岛易邦',
			),
		'25' => array(
				'1' => '哈尔滨兽医研究所',
			),
		'26' => array(
				'1' => '哈尔滨兽医研究所',
				'2' => '青岛易邦',
			),
		'27' => array(
				'1' => '哈尔滨兽医研究所',
			),
		'28' => array(
				'1' => '哈尔滨兽医研究所',
			),
		'29' => array(
				'1' => '哈尔滨兽医研究所',
			),
		'30' => array(
				'1' => '青岛立见',
			),
		'31' => array(
				'1' => '青岛立见',
			),
		'32' => array(
				'1' => '青岛立见',
			),
		'33' => array(
				'1' => 'IDEXX',
			),
		'34' => array(
				'1' => 'IDEXX',
			),
		'35' => array(
				'1' => '凯杰生物',
			),
		'36' => array(
				'1' => 'IDEXX',
				'2' => '武汉科前',
			),
		'37' => array(
				'1' => 'IDEXX',
			),
		'38' => array(
				'1' => '凯杰生物',
			),
		'39' => array(
				'1' => '北京世纪元亨',
			),
		'40' => array(
				'1' => '北京世纪元亨',
			),
		'41' => array(
				'1' => '北京世纪元亨',
			),
		'42' => array(
				'1' => 'IDEXX',
			),
		'43' => array(
				'1' => '北京世纪元亨',
			),
		'44' => array(
				'1' => '凯杰生物',
			),
		'45' => array(
				'1' => '凯杰生物',
			),
		'46' => array(
				'1' => '凯杰生物',
			),
		'47' => array(
				'1' => '凯杰生物',
			),
		'48' => array(
				'1' => '凯杰生物',
			),
		'49' => array(
				'1' => '凯杰生物',
			),
		'50' => array(
				'1' => '青岛立见',
			),
		'51' => array(
				'1' => '青岛立见',
			),
		'52' => array(
				'1' => 'IDEXX',
			),
		'53' => array(
				'1' => '北京世纪元亨',
			),
		'54' => array(
				'1' => '北京世纪元亨',
			),
		'55' => array(
				'1' => '北京世纪元亨',
			),
		'56' => array(
				'1' => '北京百泰克',
			),
		'57' => array(
				'1' => '青岛易邦',
			),
		'58' => array(
				'1' => '北京可佳永好科贸有限公司',
				'2' => '江苏天一健消毒剂有限公司',
			),
		'59' => array(
				'1' => '北京可佳永好科贸有限公司',
				'2' => '成都民生消毒剂有限公司',
				'3' => '成都民生消毒剂有限责任公司',
			),
		'60' => array(
				'1' => '北京可佳永好科贸有限公司',
			),
		'61' => array(
				'1' => '内蒙古新开元动物药业发展有限公司',
				'2' => '成都民生消毒剂有限公司',
				'3' => '镇江威特药业有限责任公司',
				'4' => '青岛明星制药有限公司',
				'5' => '上海骑骠动物保健品有限公司',
			),
		'62' => array(
				'1' => '北京可佳永好科贸有限公司',
				'2' => '山东明发兽药股份有限公司',
				'3' => '乳山市威岛化工有限公司',
				'4' => '济南深蓝动物保健品有限公司',
			),
		'63' => array(
				'1' => '未知',
			),
		'64' => array(
				'1' => '未知',
				'2' => '湖北省仙桃镇济南路36号',
				'3' => '江苏省泰州市姜堰县',
				'4' => '泰州康洁卫生用品厂',
			),
		'65' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '青岛开发区',
			),
		'66' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
				'3' => '唐山市泰特力鞋业有限公司',
				'4' => '闻喜新三一鞋业有限公司',
			),
		'67' => array(
				'1' => '未知',
				'2' => '北京爱慕技术开发有限公司',
				'3' => '山东临沂金园合线厂',
				'4' => '临沂胜旺手套制作有限公司',
			),
		'68' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '新乡市大方医疗器械制造有限公司',
			),
		'69' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
			),
		'70' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '滨州三易医疗用品有限公司',
			),
		'71' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
				'3' => '浙江省台州市路桥区金清镇卷桥',
			),
		'72' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
			),
		'73' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
			),
		'75' => array(
				'1' => '未知',
			),
		'76' => array(
				'1' => '未知',
			),
		'77' => array(
				'1' => '未知',
			),
		'78' => array(
				'1' => '未知',
				'2' => '苏州市黄埭镇青龙街18号',
			),
		'79' => array(
				'1' => '未知',
				'2' => '北京王氏伟业科技有限公司',
			),
		'80' => array(
				'1' => '未知',
				'2' => '青岛开发区',
			),
		'81' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '青岛黄金杰塑业有限公司',
			),
		'82' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '淄阳路2号',
				'4' => '即墨市同庆有限公司',
			),
		'83' => array(
				'1' => '未知',
				'2' => '上海康尔达器械有限公司',
			),
		'84' => array(
				'1' => '未知',
				'2' => '青岛开发区',
			),
		'85' => array(
				'1' => '未知',
				'2' => '青岛开发区',
			),
		'86' => array(
				'1' => '未知',
				'2' => '北京爱牧技术开发有限公司',
				'3' => '潍坊市华星医疗器械有限公司',
			),
		'87' => array(
				'1' => '未知',
			),
		'88' => array(
				'1' => '未知',
			),
		'89' => array(
				'1' => '未知',
			),
		'90' => array(
				'1' => '未知',
				'2' => '厦门视贝科技有限公司',
				'3' => '青岛开发区',
			),
		'91' => array(
				'1' => '未知',
			),
		'92' => array(
				'1' => '未知',
			),
		'93' => array(
				'1' => '未知',
			),
		'94' => array(
				'1' => '未知',
				'2' => '平度开发区',
			),
		'95' => array(
				'1' => '未知',
				'2' => '青岛开发区',
			),
		'96' => array(
				'1' => '济南青禾生物技术有限公司',
				'2' => '吉林吉和迅生物技术有限公司',
			),
		'97' => array(
				'1' => '济南青禾生物技术有限公司',
				'2' => '吉林吉和迅生物技术有限公司',
			),
		'98' => array(
				'1' => '济南青禾生物技术有限公司',
				'2' => '吉林吉和迅生物技术有限公司',
			),
		'99' => array(
				'1' => '济南青禾生物技术有限公司',
				'2' => '吉林吉和迅生物技术有限公司',
			),
		'100' => array(
				'1' => '未知',
			),
		'101' => array(
				'1' => '未知',
				'2' => '北京成英制冷新技术有限公司',
				'3' => '北京爱牧技术开发有限公司',
			),
	);
	
}